//RXGVIVP$ JOB (1),'REXXGBLV-IVP',CLASS=A,MSGCLASS=X,REGION=0M
//*
// SET VER=078
// SET IVP=IVP1
// SET IVP=I&VER
//*
//IVP      EXEC PGM=IKJEFT1B,PARM=RXGV&IVP
//STEPLIB  DD DISP=SHR,DSN=CBT669.LINKLIB
//SYSEXEC  DD DISP=SHR,DSN=CBT669.PP.REXXGBLV.V&VER..LIB
//RXGVEXP  DD RECFM=VB,LRECL=23000,SPACE=(TRK,(5,5)),UNIT=SYSDA
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
//*YSMDUMP DD DISP=OLD,DSN=CBT669.SYSMDUMP
