//RXOPIVP$ JOB (1),'RXOPIVP$',CLASS=A
//*
//IVP1     EXEC PGM=IKJEFT1B,PARM='RXOPIVP1'
//STEPLIB  DD DISP=SHR,DSN=CBT669.LINKLIB
//SYSEXEC  DD DISP=SHR,DSN=CBT669.PP.RXOPCOMM.V008.LIB
//SYSTSPRT DD SYSOUT=*,OUTLIM=200
//SYSTSIN  DD DUMMY
