//RXPNIVP$ JOB (1),'RXPNIVP1 - 009',CLASS=A,COND=(5,LT)
//*
//* RXPATTRN - REXX string pattern check
//*
//  SET VER=009
//  SET IVP=I&VER
//  SET IVP=IVP1
//*
//IVP1     EXEC PGM=IKJEFT1B,PARM='RXPN&IVP'
//STEPLIB  DD DISP=SHR,DSN=CBT669.LINKLIB
//SYSEXEC  DD DISP=SHR,DSN=CBT669.PP.RXPATTRN.V&VER..LIB
//SYSTSPRT DD SYSOUT=*,OUTLIM=(5000)
//SYSTSIN  DD DUMMY
//*
