//RXSTIVP$ JOB (1),'RXSTIVP$',
//             CLASS=A,MSGCLASS=X,REGION=32M,TIME=NOLIMIT,COND=(5,LT)
//*
//GO       EXEC PGM=IKJEFT1B,PARM='%RXSTIVP'
//STEPLIB  DD DISP=SHR,DSN=CBT669.LINKLIB
//SYSEXEC  DD DISP=SHR,DSN=CBT669.PP.REXXSTOR.V005.LIB
//SYSTSPRT DD SYSOUT=*,OUTLIM=2000
//SYSTSIN  DD DUMMY
