//RXVBIVP$ JOB (1),'RXVSAMBA-IVP',
//             CLASS=A,REGION=32M,TIME=NOLIMIT,COND=(5,LT)
//*
// SET VER=030
// SET IVP=I&VER
// SET IVP=IVP1
//*
//IVP      EXEC PGM=IKJEFT1B,PARM='RXVB&IVP'
//*TEPLIB  DD DISP=SHR,DSN=CBT669.LINKLIB
//SYSEXEC  DD DISP=SHR,DSN=CBT669.PP.RXVSAMBA.V&VER..LIB
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD DUMMY
